{
    "katellyn":
        [
            "katellyn",
            "Katellyn Ahuati",
            "CUNY Baruch College",
            "I grew up Queens, NY. I moved three times due to increasing rent, creating an emotional roller coaster for my parents as they accommodated my two brothers and me. I will always be grateful for their efforts. Curiosity about life beyond my town was a constant, especially growing up in a first-generation household. My parents, with their rich Mexican cultural heritage, whether it was the values like respect for elders, a strong sense of community, and the importance of family bonds or the soundtrack to family celebrations, adding a layer sense of comfort and liveness. Navigating school assignments in English while sharing stories at home in my native language made each day unique. However, despite the challenges I needed to understand, education was a collective dream—an investment in a future carrying the weight of familial sacrifice and the promise of breaking generational barriers. In these challenges, I discovered resilience, fueled by unwavering family support and love.",
            "Choosing the financial services industry was a personal call rooted in my fascination with understanding the stories behind numbers. The dynamic nature of the financial services industry, coupled with the opportunity to blend analytical skills with a keen understanding of economic trends, captivated me. It's a profession where I can witness the real-world effects of my efforts, and that sense of meaningful impact drives my passion for finance.",
            "Joining the Resilience, Excellence, and Diversity Initiative (RED) was driven by a profound desire to be part of a community valuing resilience, promoting excellence, and celebrating diversity. The mission was simple but effective, committing to creating an inclusive environment aligned with my personal and professional values. During my time at RED, I gained more than a network; it was a transformative experience. The collaborative atmosphere fostered a rich exchange of ideas, insights into the financial services world, diverse perspectives, and support. I learned the true value of teamwork and accountability. RED provided a platform where diverse talents converged, amplifying the collective strength of individuals committed to excellence within the industry."
        ],
    "edryan":
        [
            "edryan",
            "Edryan Canario",
            "CUNY Baruch College",
            "As a Dominican American born and raised in the Bronx, life had its adversity. We were in a poverty-stricken environment, yet the community kept it up with a vibrant lifestyle, full of color and energy. My childhood was difficult but not impossible, in my single-parent household I learned the importance of respect, family, and of course money. The constant lifestyle of my parent living paycheck to paycheck is what motivated me to pursue my college degree. Navigating this bustling city and realizing the importance of money, I wanted to grow up and provide better for my mom. She was my single most important catalyst for success so I had to prove that I could do it for her.",
            "The financial services industry has always captivated me for a multitude of reasons. Whether it was the intense high-speed nature or the opportunities for growth and impact on something, the financial services industry was congruent with my daily life. Although the motivation was there, I was underprepared and lacked the proper knowledge of this complex field, prompting me to join The Resilience, Excellence, and Diversity Initiative. A close friend initially introduced me to RED, emphasizing its importance for success in the field. Motivated by this recommendation, I promptly applied and was extended an offer to join Class 001.",
            "There were multiple things to gain from this experience yet one of RED’s core values is accountability, and that to me is its most invaluable aspect. Inside and out, I learned how to hold my teammates and myself accountable—a vital component for personal and professional growth. RED not only offers technical expertise and industry insights but it instills its core values amongst its candidates. Joining RED was a transformative experience, it was difficult, I wanted to quit, and the level of time commitment was vastly different in comparison to every other “fellowship”, but it was exactly what I needed."
        ],
    "yero":
        [
            "yero",
            "Yero Diamanka",
            "University of Chicago",
            "I was born and raised in the vibrant and diverse community of Brooklyn, NY, where the rich cultural mosaic of the area greatly influenced my upbringing. My parents are from Senegal, Africa, and emigrated to the United States before my birth. They chose to build their lives here to provide me and my four younger siblings with the vast opportunities America offers, especially in education.",
            "My aspiration to join the financial service industry stems from its dynamic nature and the intellectual challenges it presents. The sector demands continuous learning and adaptation, aligning perfectly with my lifelong commitment to education and personal growth. This industry also provides me with a fantastic opportunity to help the next generation of passionate students in various ways, including mentorship, financial literacy education, and creating pathways for underrepresented groups to access careers in finance.",
            "Joining the RED initiative was a pivotal step in my journey toward a career in finance. It opened my eyes to the array of opportunities available in sectors that often seem inaccessible to people with my background. At RED, I gained a wealth of knowledge, from personal to professional development. I honed my interview skills, strengthened my soft skills, and learned to hold myself and others accountable. Moreover, the technical skills I acquired, such as the efficient use of Microsoft Office shortcuts, have equipped me to excel in the fast-paced environment of the financial services industry."
        ],
    "natalia":
        [
            "natalia",
            "Natalia Diaz Villatoro",
            "Manhattan College",
            "Coming to New York from Guatemala with my sister as young girls was imperative in opening possibilities to better opportunities that my parents didn’t have access to growing up. Settling in a new country demanded adaptation to a different environment, where we continually navigated cultural clashes and language barriers. This experience was a pivotal moment for me because it was since then that I began to thrive on stepping out of my comfort zone – a trait that has fueled my continuous learning about the world around me.",
            "Finance offers a broad spectrum of specializations, which was a driving factor in my decision-making process. The dynamic and diverse nature of finance excites me as it not only expands one’s horizons but also unlocks opportunities that would have been unattainable without the sacrifices that my parents made. My motivation stems from the belief that pursuing a career in finance allows me to contribute to breaking down barriers and amplifying the voices of marginalized communities. As a first-generation Latina at the cusp of concluding my college journey at Manhattan College, I was thrilled to discover the Fellowship of Merit. The RED Initiative&#39;s commitment to nurturing leadership, fostering accountability, and catalyzing growth perfectly aligned with my aspirations – principles that I not only embraced but actively practiced throughout the program.",
            "The personalized mentorship, innovative curriculum, and collaborative culture of RED empowered us to strive for excellence that surpasses all expectations. Throughout the Fellowship of Merit, I embraced the challenges, cherished the growth, and embodied the values of resilience, excellence, and diversity, which I have come to learn are strategic tools for honing the skills essential for the dynamic and competitive landscape of finance. The RED Initiative, for me, marks not only a pivotal point in my personal and professional growth but also the establishment of a legacy extending beyond individual experiences – a legacy that shapes the narrative of future leaders."
        ],
    "gabriel":
        [
            "gabriel",
            "Gabriel Fernandez",
            "CUNY Baruch College",
            "Being a native New York raised in Queens I was always introverted. Coming from divorced Dominican parents in a low-income household I always wanted to make a difference in my family. I decided to start this journey of breaking generational barriers by being the first person in my family to go to college.",
            "Due to my passion for numbers and being very analytical I chose to major in Finance at Baruch College. At the time this was the peak of the pandemic in Fall of 2020. Given the circumstances, it was the best decision financially and socially. After being fascinated by the shift in the economy, it gravitated me to understand how impactful these things can be, making my decision to want to join the finance industry. I would later learn how the Finance world would be a very tough, competitive environment and I would need to be prepared for anything to be thrown at me, which ultimately led me to The RED Initiative.",
            "I would improve my confidence through skills such as leadership and public speaking. I knew the program would not be roses and sunshine, and that I would have to work hard to graduate. Nonetheless, I was able to get the experience I was looking for; learning how to be a good leader, adapting to being put on a new team, and taking accountability for my actions. I know we all have hidden potential within ourselves. We are all capable of much more than what we are and being in RED encouraged me to tap into that potential to become a better person both professionally and personally."
        ],
    "abdul":
        [
            "abdul",
            "Abdul Ganiyuajani",
            "CUNY City College",
            "Growing up in the vibrant borough of the Bronx, being the middle child of five siblings, and proudly embracing my Nigerian heritage has significantly shaped my aspirations. Steeped-up cultural diversity and urbanization offered me a strong sense of identity. I felt as if I had to go to pursue something greater than myself to impress those around me. Yet, whether it was embarking on my academic journey with college or grappling with the desire for a better life for my family there was always an underlying feeling of uncertainty.",
            "My experience began when I joined the product management cohort of my coding program. Unbeknownst to me, this cohort would not use coding, which was unusual, but I persisted. At the time, the teacher explained the responsibilities of a product manager, including how they develop new goods from the planning stage to the final product launch, as well as all the essential processes from start to finish to ensure success. The notion was so appealing that it inspired me to seek a career in both business and technology. Yet I still want clarity and an understanding of the business world.",
            "However, being a freshman joining the Resilience, Experience, and Diversity Initiative allowed me to find that guidance and clarity for what I genuinely wanted to do. Being from the Bronx I didn’t have the resources that allowed me to understand and navigate the business world, making me unconfident. Yet RED’s combination of exposure to diverse professional perspectives and hands-on technical activities solidified that conviction to drive for success."
        ],
    "juliana":
        [
            "juliana",
            "Juliana Martinez",
            "CUNY Hunter College",
            "My parents are from the Dominican Republic and raised me in Brooklyn, New York. I have three older siblings and I’m the only girl in my family, I had a lot to prove because I was the youngest. I had to live up to the expectations that my brothers had already put up and the expectations my parents had already set. This served as motivation to become the version of myself that I can be.",
            "Growing up with a background deeply rooted in entrepreneurship, my father owned a deli and gave me the opportunity to work. Throughout the years of working under my father, I’ve witnessed my father’s journey and the obstacles he faced in owning a business, this served as an inspiration for a career in finance. Unsure of a specific career path, I went to an info session at my college where I met Nick and heard about The RED Initiative.",
            "My biggest struggle before and during the fellowship was my confidence. Yet, I discovered the indispensable value of being confident when conveying ideas and perspectives. Embracing each role that I undertook, whether it was a leadership role or being a squad member, I recognized the significance of learning through trial and error. My confidence wasn’t going to improve without being pushed by RED. Hearing from different keynote speakers, I was shown the diverse career possibilities within the financial services sector, which not only bolstered my confidence but reinforced my determination to pursue a career in finance."
        ],
    "jason":
        [
            "jason",
            "Jason Maza",
            "CUNY Baruch College",
            "Born and raised in Queens, NY, in a Latin American community, my upbringing was heavily shaped by the people here. Like many Latinos, my parents immigrated to the United States to provide a better life for me, and with that, came a lot of expectations, many of which I felt obligated to accomplish, alone too because I didn’t have a clear sense of direction.",
            "Entering Baruch College, finance was the go-to degree everybody pursued, for good reason too, as it providedan escape from the typical blue-collar jobs our families had. It was the path I knew I had to take so I quicklybegan joining clubs on campus, attending company info sessions, office visits, and participating in professionaldevelopment programs, all of which illustrated the demand this field had, which not only was extremely competitive and demanding but very rewarding.",
            "Since joining The RED Initiative, I was able to jumpstart my college career to lengths I couldn’t have otherwiseachieved. From mastering the elevator pitch to writing professional emails to presenting weekly market updates,there was always something for me to work on, many of which I improved upon since day 1. Through RED, Iwas able to grow both personally and professionally thanks to its unique model of phases, each tailored to aspecific skill. Beyond this, RED fosters a culture of camaraderie that I have not seen anywhere else, where each RED Candidate is supported and included, both of which I can vouch for heavily."
        ],
    "diogo":
        [
            "diogo",
            "Diogo Montalvo",
            "New York University",
            "Residing in Jersey City, NJ my entire life has allowed me to encounter a diverse range of people, spanningvarious social backgrounds. I’m a first-generation, low-income, Ecuadorian student and have gotten where I am thus far because of the sacrifices my family has made.",
            "My venture into the financial services industry was not by chance but driven by the need to be financially freeand give back to those I love. Furthermore, the financial services industry allows me to merge my fascinationwith financial decisions' effect on individuals with my passion for making a meaningful impact in my community while consistently applying qualities that promote personal growth.",
            "When I found out about The RED Initiative, I was instantly drawn to the program because it did something thatother organizations don’t: instill discipline, accountability, and leadership in all of its participants through thestandards that are set and must be followed. Through RED I’ve developed the qualities necessary to lead a team,the ability to adapt and assert myself effectively in challenging uncomfortable situations, and gained valuable insights into an industry that lacks real, non-sugarcoated mentorship for Latino students."
        ],
    "nick":
        [
            "nick",
            "Nick Rodriguez",
            "Swarthmore College",
            "Upon relocating to New York City from the Dominican Republic at the age of three, my early years included a multitude of cultural transitions. The physical separation of me and my mother, who stayed back in the D.R. to save money for our family, further compounded this feeling of being lost. I grew up navigating the education system with little to no help from my family members, who were occupied learning English and working long shifts.",
            "My interest in the financial services industry began with my influential Economics teacher at Stuyvesant HighSchool. This teacher not only taught me about personal finance but also made me aware of the potential to be a financial resource for my family, who had limited knowledge in this area. My career path is, in part, motivated by a desire to support my loved ones.",
            "Joining The RED Initiative has had a profound impact on me. This distinguished program not only equipped me with essential skills for the financial services industry but also fostered discipline and motivation, something that is hard to find in other professional development programs. Through RED, I most importantly gained a transformed mindset, becoming more resilient and focused. Armed with an array of invaluable tools, RED fortified my confidence and reinforced my decision on wanting to enter the financial services industry."
        ],
    "jazmin":
        [
            "jazmin",
            "Jazmin Solano",
            "CUNY Baruch College",
            "I was born and raised in Queens in a Mexican household, and I am a first-generation college student. This title, however, comes with its own set of expectations, which can sometimes be overwhelming. My biggest motivators are seeing my family work hard; their efforts inspire me to strive for excellence. I want to help push my family forward and achieve a better lifestyle in the future. That desire makes being a first-generation college student special. Despite our share of struggles, there&#39;s a steep learning curve from which we can greatly benefit.",
            "From elementary school through high school, the idea of attending college was always seen as the first step toward success. During my high school years, my goal was to get into Baruch College and major in Finance. However, I often faced uncertainty, especially in understanding the nuances of the financial services industry. A fellow club member introduced me to The RED Initiative, which immediately caught my attention due to its unique perspective on campus recruitment—a process often not thoroughly discussed elsewhere.",
            "The RED Initiative's Fellowship of Merit presented me with various challenging roles, including being an RED Candidate, Squad Leader, and Class Leader. Each role and phase enriched my understanding of the corporate world. The challenging nature of the Fellowship of Merit highlighted the importance of maintaining a strong work ethic and focus, especially in a group setting. This experience not only tested my individual abilities but also emphasized the significance of collaboration and collective effort in achieving success. Looking back, as I completed the program, I realize the significant growth I experienced. I gained invaluable insights into my own strengths and weaknesses. This focus on self-improvement is a fundamental aspect of the fellowship. We underwent Peer Evaluations at the end of each phase, where our peers would assess and provide feedback on our performance. The RED initiative created an opportunity for me to work and learn alongside peers from similar backgrounds, fostering a collaborative and insightful learning environment."
        ]

}